-- 1.查询学生及其所在班级的信息，显示格式为：学号,姓名,性别,班级名,班级人数


-- 2.查看各系的班级信息，显示的格式为：系别名称,班级名,班级人数
-- 按班级人数降序排序


-- 3.查询学生所有课程的成绩，显示的格式为：学生编号,考试编号,课程名称,分数
-- 要求：根据学生编号升序排序


-- 4.查询学生所有课程的成绩，显示的格式为：学生编号,考试类型,课程名称,分数
-- 要求：先按学生编号升序排序,后按考试类型升序排序


-- 5.查看辅导员带班的数量，显示格式为：辅导员编号,辅导员姓名,带班数量
-- 要求：辅导员编号升序排序


-- 6.查询与张苗苗同乡的学生信息
-- 要求：使用子查询实现

-- 7.查询成绩没有合格的学生信息
-- 要求：使用子查询实现


-- 8.查询学生的各科的成绩，显示格式为：学号,姓名,考试编号,课程名称,分数
-- 要求：按课程名称升序,考试编号升序,分数降序查询


-- 9.把老师信息与辅导员信息两张表的数据合并在一张表中，显示的格式为：姓名,性别,年龄,民族,籍贯,联系电话


-- 10.统计所有学生的成绩的总分，显示的格式为：学号,姓名,总成绩，要求如下：
-- 根据学号升序排序
-- 如果分数为null，则输出0


